loadtest/results/20260922-184451/5-top-no-cache.txt
Running 1m test @ https://cache-api-alb-1834554219.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 147.693ms, rate sampling interval: 243ms
  Thread calibration: mean lat.: 2705.037ms, rate sampling interval: 14426ms
  Thread calibration: mean lat.: 160.614ms, rate sampling interval: 249ms
  Thread calibration: mean lat.: 3080.639ms, rate sampling interval: 14729ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.08s     4.86s   34.24s    84.47%
    Req/Sec    73.96     81.40   221.00     67.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   95.94ms
 75.000%    4.73s 
 90.000%   10.40s 
 99.000%   19.97s 
 99.900%   26.25s 
 99.990%   33.69s 
 99.999%   34.28s 
100.000%   34.28s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      79.615     0.000000            1         1.00
      86.655     0.100000         1512         1.11
      88.703     0.200000         2988         1.25
      90.559     0.300000         4485         1.43
      92.543     0.400000         5968         1.67
      95.935     0.500000         7439         2.00
     106.879     0.550000         8182         2.22
    1047.039     0.600000         8925         2.50
    2361.343     0.650000         9670         2.86
    3399.679     0.700000        10414         3.33
    4730.879     0.750000        11157         4.00
    5517.311     0.775000        11529         4.44
    6270.975     0.800000        11900         5.00
    7151.615     0.825000        12273         5.71
    8146.943     0.850000        12644         6.67
    9183.231     0.875000        13022         8.00
    9748.479     0.887500        13202         8.89
   10403.839     0.900000        13388        10.00
   11165.695     0.912500        13574        11.43
   11984.895     0.925000        13760        13.33
   12935.167     0.937500        13947        16.00
   13434.879     0.943750        14040        17.78
   13991.935     0.950000        14133        20.00
   14557.183     0.956250        14225        22.86
   15179.775     0.962500        14319        26.67
   15884.287     0.968750        14411        32.00
   16318.463     0.971875        14458        35.56
   16859.135     0.975000        14505        40.00
   17448.959     0.978125        14551        45.71
   18038.783     0.981250        14597        53.33
   18628.607     0.984375        14644        64.00
   18972.671     0.985938        14667        71.11
   19300.351     0.987500        14690        80.00
   19775.487     0.989062        14714        91.43
   20135.935     0.990625        14736       106.67
   20594.687     0.992188        14759       128.00
   20840.447     0.992969        14773       142.22
   21118.975     0.993750        14783       160.00
   21299.199     0.994531        14794       182.86
   21692.415     0.995313        14806       213.33
   22003.711     0.996094        14817       256.00
   22347.775     0.996484        14823       284.44
   22593.535     0.996875        14829       320.00
   22986.751     0.997266        14835       365.71
   23494.655     0.997656        14841       426.67
   24150.015     0.998047        14846       512.00
   24363.007     0.998242        14849       568.89
   24870.911     0.998437        14852       640.00
   25460.735     0.998633        14855       731.43
   25788.415     0.998828        14858       853.33
   26361.855     0.999023        14861      1024.00
   26623.999     0.999121        14862      1137.78
   26820.607     0.999219        14864      1280.00
   26935.295     0.999316        14865      1462.86
   27410.431     0.999414        14867      1706.67
   27983.871     0.999512        14868      2048.00
   28344.319     0.999561        14869      2275.56
   28573.695     0.999609        14870      2560.00
   28573.695     0.999658        14870      2925.71
   28934.143     0.999707        14871      3413.33
   29507.583     0.999756        14872      4096.00
   29507.583     0.999780        14872      4551.11
   31604.735     0.999805        14873      5120.00
   31604.735     0.999829        14873      5851.43
   31604.735     0.999854        14873      6826.67
   33685.503     0.999878        14874      8192.00
   33685.503     0.999890        14874      9102.22
   33685.503     0.999902        14874     10240.00
   33685.503     0.999915        14874     11702.86
   33685.503     0.999927        14874     13653.33
   34275.327     0.999939        14875     16384.00
   34275.327     1.000000        14875          inf
#[Mean    =     3080.355, StdDeviation   =     4859.569]
#[Max     =    34242.560, Total count    =        14875]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17093 requests in 1.00m, 5.31MB read
  Socket errors: connect 0, read 0, write 0, timeout 990
  Non-2xx or 3xx responses: 16024
Requests/sec:    284.52
Transfer/sec:     90.53KB
------------------------------
X-Cache  HIT=0  MISS=0  BYPASS=1069  writes=0  http_errors=16024
Successful req/s: 17.79  (93.7% of 17093 responses were errors)
Socket errors: connect=0 read=0 write=0 timeout=990
p50       95.94 ms
p90    10403.84 ms
p99    19972.10 ms
p99.9  26247.17 ms