loadtest/results/20260922-184451/6-top-cache.txt
Running 1m test @ https://cache-api-alb-1834554219.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 288.883ms, rate sampling interval: 1575ms
  Thread calibration: mean lat.: 342.897ms, rate sampling interval: 2623ms
  Thread calibration: mean lat.: 149.585ms, rate sampling interval: 519ms
  Thread calibration: mean lat.: 186.372ms, rate sampling interval: 553ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    96.74ms    9.03ms 230.91ms   92.73%
    Req/Sec    74.87     31.90    96.00     85.11%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   95.17ms
 75.000%   98.37ms
 90.000%  102.85ms
 99.000%  132.22ms
 99.900%  184.32ms
 99.990%  229.76ms
 99.999%  231.04ms
100.000%  231.04ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      82.879     0.000000            1         1.00
      90.431     0.100000         1548         1.11
      91.903     0.200000         3044         1.25
      93.055     0.300000         4498         1.43
      94.143     0.400000         6074         1.67
      95.167     0.500000         7532         2.00
      95.743     0.550000         8282         2.22
      96.255     0.600000         8981         2.50
      96.895     0.650000         9749         2.86
      97.599     0.700000        10512         3.33
      98.367     0.750000        11235         4.00
      98.815     0.775000        11600         4.44
      99.391     0.800000        11970         5.00
      99.967     0.825000        12342         5.71
     100.671     0.850000        12705         6.67
     101.631     0.875000        13078         8.00
     102.207     0.887500        13274         8.89
     102.847     0.900000        13445        10.00
     103.615     0.912500        13631        11.43
     104.511     0.925000        13821        13.33
     105.727     0.937500        14005        16.00
     106.559     0.943750        14105        17.78
     107.711     0.950000        14199        20.00
     109.055     0.956250        14286        22.86
     111.359     0.962500        14377        26.67
     113.535     0.968750        14471        32.00
     114.751     0.971875        14517        35.56
     116.159     0.975000        14566        40.00
     117.631     0.978125        14611        45.71
     120.127     0.981250        14657        53.33
     123.391     0.984375        14704        64.00
     125.055     0.985938        14727        71.11
     127.615     0.987500        14751        80.00
     130.367     0.989062        14774        91.43
     133.375     0.990625        14797       106.67
     138.111     0.992188        14821       128.00
     140.543     0.992969        14833       142.22
     155.519     0.993750        14845       160.00
     162.175     0.994531        14856       182.86
     167.935     0.995313        14867       213.33
     170.751     0.996094        14880       256.00
     172.287     0.996484        14886       284.44
     173.055     0.996875        14891       320.00
     175.487     0.997266        14897       365.71
     178.431     0.997656        14902       426.67
     180.479     0.998047        14908       512.00
     181.119     0.998242        14911       568.89
     182.143     0.998437        14915       640.00
     182.527     0.998633        14917       731.43
     183.295     0.998828        14920       853.33
     185.599     0.999023        14923      1024.00
     191.615     0.999121        14924      1137.78
     194.687     0.999219        14926      1280.00
     201.087     0.999316        14927      1462.86
     201.855     0.999414        14929      1706.67
     202.239     0.999512        14930      2048.00
     203.135     0.999561        14931      2275.56
     203.263     0.999609        14932      2560.00
     203.263     0.999658        14932      2925.71
     205.951     0.999707        14933      3413.33
     213.503     0.999756        14934      4096.00
     213.503     0.999780        14934      4551.11
     229.631     0.999805        14935      5120.00
     229.631     0.999829        14935      5851.43
     229.631     0.999854        14935      6826.67
     229.759     0.999878        14936      8192.00
     229.759     0.999890        14936      9102.22
     229.759     0.999902        14936     10240.00
     229.759     0.999915        14936     11702.86
     229.759     0.999927        14936     13653.33
     231.039     0.999939        14937     16384.00
     231.039     1.000000        14937          inf
#[Mean    =       96.736, StdDeviation   =        9.027]
#[Max     =      230.912, Total count    =        14937]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17902 requests in 1.00m, 17.23MB read
  Socket errors: connect 0, read 0, write 0, timeout 11
  Non-2xx or 3xx responses: 1256
Requests/sec:    296.99
Transfer/sec:    292.65KB
------------------------------
X-Cache  HIT=16578  MISS=68  BYPASS=0  writes=0  http_errors=1256
Cache hit ratio: 99.59%
Successful req/s: 276.16  (7.0% of 17902 responses were errors)
Socket errors: connect=0 read=0 write=0 timeout=11
p50       95.17 ms
p90      102.85 ms
p99      132.22 ms
p99.9    184.32 ms